espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/tee_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Tee mode control register */
/** Type of mn_mode_ctrl register
 *  TEE mode control register
 */
typedef union {
    struct {
        /** mn_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures Mn security level mode.
         *  0: tee_mode
         *  1: ree_mode0
         *  2: ree_mode1
         *  3: ree_mode2
         */
        uint32_t mn_mode:2;
        /** mn_lock : R/W; bitpos: [2]; default: 0;
         *  Set 1 to lock m0 tee configuration
         */
        uint32_t mn_lock:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} tee_mn_mode_ctrl_reg_t;


/** Group: read write control register */
/** Type of gpspi0_ctrl register
 *  gpspi0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_gpspi0 : R/W; bitpos: [0]; default: 1;
         *  Configures gpspi0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_gpspi0:1;
        /** read_ree0_gpspi0 : R/W; bitpos: [1]; default: 0;
         *  Configures gpspi0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_gpspi0:1;
        /** read_ree1_gpspi0 : R/W; bitpos: [2]; default: 0;
         *  Configures gpspi0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_gpspi0:1;
        /** read_ree2_gpspi0 : R/W; bitpos: [3]; default: 0;
         *  Configures gpspi0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_gpspi0:1;
        /** write_tee_gpspi0 : R/W; bitpos: [4]; default: 1;
         *  Configures gpspi0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_gpspi0:1;
        /** write_ree0_gpspi0 : R/W; bitpos: [5]; default: 0;
         *  Configures gpspi0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_gpspi0:1;
        /** write_ree1_gpspi0 : R/W; bitpos: [6]; default: 0;
         *  Configures gpspi0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_gpspi0:1;
        /** write_ree2_gpspi0 : R/W; bitpos: [7]; default: 0;
         *  Configures gpspi0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_gpspi0:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_gpspi0_ctrl_reg_t;

/** Type of gpspi1_ctrl register
 *  gpspi1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_gpspi1 : R/W; bitpos: [0]; default: 1;
         *  Configures gpspi1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_gpspi1:1;
        /** read_ree0_gpspi1 : R/W; bitpos: [1]; default: 0;
         *  Configures gpspi1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_gpspi1:1;
        /** read_ree1_gpspi1 : R/W; bitpos: [2]; default: 0;
         *  Configures gpspi1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_gpspi1:1;
        /** read_ree2_gpspi1 : R/W; bitpos: [3]; default: 0;
         *  Configures gpspi1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_gpspi1:1;
        /** write_tee_gpspi1 : R/W; bitpos: [4]; default: 1;
         *  Configures gpspi1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_gpspi1:1;
        /** write_ree0_gpspi1 : R/W; bitpos: [5]; default: 0;
         *  Configures gpspi1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_gpspi1:1;
        /** write_ree1_gpspi1 : R/W; bitpos: [6]; default: 0;
         *  Configures gpspi1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_gpspi1:1;
        /** write_ree2_gpspi1 : R/W; bitpos: [7]; default: 0;
         *  Configures gpspi1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_gpspi1:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_gpspi1_ctrl_reg_t;

/** Type of uart0_ctrl register
 *  uart0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_uart0 : R/W; bitpos: [0]; default: 1;
         *  Configures uart0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_uart0:1;
        /** read_ree0_uart0 : R/W; bitpos: [1]; default: 0;
         *  Configures uart0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_uart0:1;
        /** read_ree1_uart0 : R/W; bitpos: [2]; default: 0;
         *  Configures uart0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_uart0:1;
        /** read_ree2_uart0 : R/W; bitpos: [3]; default: 0;
         *  Configures uart0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_uart0:1;
        /** write_tee_uart0 : R/W; bitpos: [4]; default: 1;
         *  Configures uart0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_uart0:1;
        /** write_ree0_uart0 : R/W; bitpos: [5]; default: 0;
         *  Configures uart0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_uart0:1;
        /** write_ree1_uart0 : R/W; bitpos: [6]; default: 0;
         *  Configures uart0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_uart0:1;
        /** write_ree2_uart0 : R/W; bitpos: [7]; default: 0;
         *  Configures uart0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_uart0:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_uart0_ctrl_reg_t;

/** Type of uart1_ctrl register
 *  uart1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_uart1 : R/W; bitpos: [0]; default: 1;
         *  Configures uart1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_uart1:1;
        /** read_ree0_uart1 : R/W; bitpos: [1]; default: 0;
         *  Configures uart1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_uart1:1;
        /** read_ree1_uart1 : R/W; bitpos: [2]; default: 0;
         *  Configures uart1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_uart1:1;
        /** read_ree2_uart1 : R/W; bitpos: [3]; default: 0;
         *  Configures uart1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_uart1:1;
        /** write_tee_uart1 : R/W; bitpos: [4]; default: 1;
         *  Configures uart1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_uart1:1;
        /** write_ree0_uart1 : R/W; bitpos: [5]; default: 0;
         *  Configures uart1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_uart1:1;
        /** write_ree1_uart1 : R/W; bitpos: [6]; default: 0;
         *  Configures uart1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_uart1:1;
        /** write_ree2_uart1 : R/W; bitpos: [7]; default: 0;
         *  Configures uart1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_uart1:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_uart1_ctrl_reg_t;

/** Type of uhci_ctrl register
 *  uhci read/write control register
 */
typedef union {
    struct {
        /** read_tee_uhci : R/W; bitpos: [0]; default: 1;
         *  Configures uhci registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_uhci:1;
        /** read_ree0_uhci : R/W; bitpos: [1]; default: 0;
         *  Configures uhci registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_uhci:1;
        /** read_ree1_uhci : R/W; bitpos: [2]; default: 0;
         *  Configures uhci registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_uhci:1;
        /** read_ree2_uhci : R/W; bitpos: [3]; default: 0;
         *  Configures uhci registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_uhci:1;
        /** write_tee_uhci : R/W; bitpos: [4]; default: 1;
         *  Configures uhci registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_uhci:1;
        /** write_ree0_uhci : R/W; bitpos: [5]; default: 0;
         *  Configures uhci registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_uhci:1;
        /** write_ree1_uhci : R/W; bitpos: [6]; default: 0;
         *  Configures uhci registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_uhci:1;
        /** write_ree2_uhci : R/W; bitpos: [7]; default: 0;
         *  Configures uhci registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_uhci:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_uhci_ctrl_reg_t;

