espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/tee_struct.h
/** Type of i2c0_ctrl register
 *  i2c0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_i2c0 : R/W; bitpos: [0]; default: 1;
         *  Configures i2c0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_i2c0:1;
        /** read_ree0_i2c0 : R/W; bitpos: [1]; default: 0;
         *  Configures i2c0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_i2c0:1;
        /** read_ree1_i2c0 : R/W; bitpos: [2]; default: 0;
         *  Configures i2c0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_i2c0:1;
        /** read_ree2_i2c0 : R/W; bitpos: [3]; default: 0;
         *  Configures i2c0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_i2c0:1;
        /** write_tee_i2c0 : R/W; bitpos: [4]; default: 1;
         *  Configures i2c0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_i2c0:1;
        /** write_ree0_i2c0 : R/W; bitpos: [5]; default: 0;
         *  Configures i2c0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_i2c0:1;
        /** write_ree1_i2c0 : R/W; bitpos: [6]; default: 0;
         *  Configures i2c0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_i2c0:1;
        /** write_ree2_i2c0 : R/W; bitpos: [7]; default: 0;
         *  Configures i2c0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_i2c0:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_i2c0_ctrl_reg_t;

/** Type of i2c1_ctrl register
 *  i2c1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_i2c1 : R/W; bitpos: [0]; default: 1;
         *  Configures i2c1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_i2c1:1;
        /** read_ree0_i2c1 : R/W; bitpos: [1]; default: 0;
         *  Configures i2c1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_i2c1:1;
        /** read_ree1_i2c1 : R/W; bitpos: [2]; default: 0;
         *  Configures i2c1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_i2c1:1;
        /** read_ree2_i2c1 : R/W; bitpos: [3]; default: 0;
         *  Configures i2c1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_i2c1:1;
        /** write_tee_i2c1 : R/W; bitpos: [4]; default: 1;
         *  Configures i2c1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_i2c1:1;
        /** write_ree0_i2c1 : R/W; bitpos: [5]; default: 0;
         *  Configures i2c1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_i2c1:1;
        /** write_ree1_i2c1 : R/W; bitpos: [6]; default: 0;
         *  Configures i2c1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_i2c1:1;
        /** write_ree2_i2c1 : R/W; bitpos: [7]; default: 0;
         *  Configures i2c1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_i2c1:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_i2c1_ctrl_reg_t;

/** Type of i2s_ctrl register
 *  i2s read/write control register
 */
typedef union {
    struct {
        /** read_tee_i2s : R/W; bitpos: [0]; default: 1;
         *  Configures i2s registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_i2s:1;
        /** read_ree0_i2s : R/W; bitpos: [1]; default: 0;
         *  Configures i2s registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_i2s:1;
        /** read_ree1_i2s : R/W; bitpos: [2]; default: 0;
         *  Configures i2s registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_i2s:1;
        /** read_ree2_i2s : R/W; bitpos: [3]; default: 0;
         *  Configures i2s registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_i2s:1;
        /** write_tee_i2s : R/W; bitpos: [4]; default: 1;
         *  Configures i2s registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_i2s:1;
        /** write_ree0_i2s : R/W; bitpos: [5]; default: 0;
         *  Configures i2s registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_i2s:1;
        /** write_ree1_i2s : R/W; bitpos: [6]; default: 0;
         *  Configures i2s registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_i2s:1;
        /** write_ree2_i2s : R/W; bitpos: [7]; default: 0;
         *  Configures i2s registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_i2s:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_i2s_ctrl_reg_t;

/** Type of parl_io_ctrl register
 *  parl_io read/write control register
 */
typedef union {
    struct {
        /** read_tee_parl_io : R/W; bitpos: [0]; default: 1;
         *  Configures parl_io registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_parl_io:1;
        /** read_ree0_parl_io : R/W; bitpos: [1]; default: 0;
         *  Configures parl_io registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_parl_io:1;
        /** read_ree1_parl_io : R/W; bitpos: [2]; default: 0;
         *  Configures parl_io registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_parl_io:1;
        /** read_ree2_parl_io : R/W; bitpos: [3]; default: 0;
         *  Configures parl_io registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_parl_io:1;
        /** write_tee_parl_io : R/W; bitpos: [4]; default: 1;
         *  Configures parl_io registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_parl_io:1;
        /** write_ree0_parl_io : R/W; bitpos: [5]; default: 0;
         *  Configures parl_io registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_parl_io:1;
        /** write_ree1_parl_io : R/W; bitpos: [6]; default: 0;
         *  Configures parl_io registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_parl_io:1;
        /** write_ree2_parl_io : R/W; bitpos: [7]; default: 0;
         *  Configures parl_io registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_parl_io:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_parl_io_ctrl_reg_t;

/** Type of pwm0_ctrl register
 *  pwm0 read/write control register
 */
typedef union {
    struct {
        /** read_tee_pwm0 : R/W; bitpos: [0]; default: 1;
         *  Configures pwm0 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_pwm0:1;
        /** read_ree0_pwm0 : R/W; bitpos: [1]; default: 0;
         *  Configures pwm0 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_pwm0:1;
        /** read_ree1_pwm0 : R/W; bitpos: [2]; default: 0;
         *  Configures pwm0 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_pwm0:1;
        /** read_ree2_pwm0 : R/W; bitpos: [3]; default: 0;
         *  Configures pwm0 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_pwm0:1;
        /** write_tee_pwm0 : R/W; bitpos: [4]; default: 1;
         *  Configures pwm0 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_pwm0:1;
        /** write_ree0_pwm0 : R/W; bitpos: [5]; default: 0;
         *  Configures pwm0 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_pwm0:1;
        /** write_ree1_pwm0 : R/W; bitpos: [6]; default: 0;
         *  Configures pwm0 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_pwm0:1;
        /** write_ree2_pwm0 : R/W; bitpos: [7]; default: 0;
         *  Configures pwm0 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_pwm0:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_pwm0_ctrl_reg_t;

/** Type of pwm1_ctrl register
 *  pwm1 read/write control register
 */
typedef union {
    struct {
        /** read_tee_pwm1 : R/W; bitpos: [0]; default: 1;
         *  Configures pwm1 registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_pwm1:1;
        /** read_ree0_pwm1 : R/W; bitpos: [1]; default: 0;
         *  Configures pwm1 registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_pwm1:1;
        /** read_ree1_pwm1 : R/W; bitpos: [2]; default: 0;
         *  Configures pwm1 registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_pwm1:1;
        /** read_ree2_pwm1 : R/W; bitpos: [3]; default: 0;
         *  Configures pwm1 registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_pwm1:1;
        /** write_tee_pwm1 : R/W; bitpos: [4]; default: 1;
         *  Configures pwm1 registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_pwm1:1;
        /** write_ree0_pwm1 : R/W; bitpos: [5]; default: 0;
         *  Configures pwm1 registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_pwm1:1;
        /** write_ree1_pwm1 : R/W; bitpos: [6]; default: 0;
         *  Configures pwm1 registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_pwm1:1;
        /** write_ree2_pwm1 : R/W; bitpos: [7]; default: 0;
         *  Configures pwm1 registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_pwm1:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_pwm1_ctrl_reg_t;

/** Type of ledc_ctrl register
 *  ledc read/write control register
 */
typedef union {
    struct {
        /** read_tee_ledc : R/W; bitpos: [0]; default: 1;
         *  Configures ledc registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_ledc:1;
        /** read_ree0_ledc : R/W; bitpos: [1]; default: 0;
         *  Configures ledc registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_ledc:1;
        /** read_ree1_ledc : R/W; bitpos: [2]; default: 0;
         *  Configures ledc registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_ledc:1;
        /** read_ree2_ledc : R/W; bitpos: [3]; default: 0;
         *  Configures ledc registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_ledc:1;
        /** write_tee_ledc : R/W; bitpos: [4]; default: 1;
         *  Configures ledc registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_ledc:1;
        /** write_ree0_ledc : R/W; bitpos: [5]; default: 0;
         *  Configures ledc registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_ledc:1;
        /** write_ree1_ledc : R/W; bitpos: [6]; default: 0;
         *  Configures ledc registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_ledc:1;
        /** write_ree2_ledc : R/W; bitpos: [7]; default: 0;
         *  Configures ledc registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_ledc:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_ledc_ctrl_reg_t;

/** Type of can_ctrl register
 *  can read/write control register
 */
typedef union {
    struct {
        /** read_tee_can : R/W; bitpos: [0]; default: 1;
         *  Configures can registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_can:1;
        /** read_ree0_can : R/W; bitpos: [1]; default: 0;
         *  Configures can registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_can:1;
        /** read_ree1_can : R/W; bitpos: [2]; default: 0;
         *  Configures can registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_can:1;
        /** read_ree2_can : R/W; bitpos: [3]; default: 0;
         *  Configures can registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_can:1;
        /** write_tee_can : R/W; bitpos: [4]; default: 1;
         *  Configures can registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_can:1;
        /** write_ree0_can : R/W; bitpos: [5]; default: 0;
         *  Configures can registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_can:1;
        /** write_ree1_can : R/W; bitpos: [6]; default: 0;
         *  Configures can registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_can:1;
        /** write_ree2_can : R/W; bitpos: [7]; default: 0;
         *  Configures can registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_can:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_can_ctrl_reg_t;

/** Type of usb_serial_jtag_ctrl register
 *  usb_serial_jtag read/write control register
 */
typedef union {
    struct {
        /** read_tee_usb_serial_jtag : R/W; bitpos: [0]; default: 1;
         *  Configures usb_serial_jtag registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_usb_serial_jtag:1;
        /** read_ree0_usb_serial_jtag : R/W; bitpos: [1]; default: 0;
         *  Configures usb_serial_jtag registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_usb_serial_jtag:1;
        /** read_ree1_usb_serial_jtag : R/W; bitpos: [2]; default: 0;
         *  Configures usb_serial_jtag registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_usb_serial_jtag:1;
        /** read_ree2_usb_serial_jtag : R/W; bitpos: [3]; default: 0;
         *  Configures usb_serial_jtag registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_usb_serial_jtag:1;
        /** write_tee_usb_serial_jtag : R/W; bitpos: [4]; default: 1;
         *  Configures usb_serial_jtag registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_usb_serial_jtag:1;
        /** write_ree0_usb_serial_jtag : R/W; bitpos: [5]; default: 0;
         *  Configures usb_serial_jtag registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_usb_serial_jtag:1;
        /** write_ree1_usb_serial_jtag : R/W; bitpos: [6]; default: 0;
         *  Configures usb_serial_jtag registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_usb_serial_jtag:1;
        /** write_ree2_usb_serial_jtag : R/W; bitpos: [7]; default: 0;
         *  Configures usb_serial_jtag registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_usb_serial_jtag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_usb_serial_jtag_ctrl_reg_t;

