espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/tee_struct.h
/** Type of misc_ctrl register
 *  misc read/write control register
 */
typedef union {
    struct {
        /** read_tee_misc : R/W; bitpos: [0]; default: 1;
         *  Configures misc registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_misc:1;
        /** read_ree0_misc : R/W; bitpos: [1]; default: 0;
         *  Configures misc registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_misc:1;
        /** read_ree1_misc : R/W; bitpos: [2]; default: 0;
         *  Configures misc registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_misc:1;
        /** read_ree2_misc : R/W; bitpos: [3]; default: 0;
         *  Configures misc registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_misc:1;
        /** write_tee_misc : R/W; bitpos: [4]; default: 1;
         *  Configures misc registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_misc:1;
        /** write_ree0_misc : R/W; bitpos: [5]; default: 0;
         *  Configures misc registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_misc:1;
        /** write_ree1_misc : R/W; bitpos: [6]; default: 0;
         *  Configures misc registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_misc:1;
        /** write_ree2_misc : R/W; bitpos: [7]; default: 0;
         *  Configures misc registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_misc:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_misc_ctrl_reg_t;

/** Type of src_ctrl register
 *  src read/write control register
 */
typedef union {
    struct {
        /** read_tee_src : R/W; bitpos: [0]; default: 1;
         *  Configures src registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_src:1;
        /** read_ree0_src : R/W; bitpos: [1]; default: 0;
         *  Configures src registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_src:1;
        /** read_ree1_src : R/W; bitpos: [2]; default: 0;
         *  Configures src registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_src:1;
        /** read_ree2_src : R/W; bitpos: [3]; default: 0;
         *  Configures src registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_src:1;
        /** write_tee_src : R/W; bitpos: [4]; default: 1;
         *  Configures src registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_src:1;
        /** write_ree0_src : R/W; bitpos: [5]; default: 0;
         *  Configures src registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_src:1;
        /** write_ree1_src : R/W; bitpos: [6]; default: 0;
         *  Configures src registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_src:1;
        /** write_ree2_src : R/W; bitpos: [7]; default: 0;
         *  Configures src registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_src:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_src_ctrl_reg_t;

/** Type of usb_otg_fs_core_ctrl register
 *  usb_otg_fs_core read/write control register
 */
typedef union {
    struct {
        /** read_tee_usb_otg_fs_core : R/W; bitpos: [0]; default: 1;
         *  Configures usb_otg_fs_core registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_usb_otg_fs_core:1;
        /** read_ree0_usb_otg_fs_core : R/W; bitpos: [1]; default: 0;
         *  Configures usb_otg_fs_core registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_usb_otg_fs_core:1;
        /** read_ree1_usb_otg_fs_core : R/W; bitpos: [2]; default: 0;
         *  Configures usb_otg_fs_core registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_usb_otg_fs_core:1;
        /** read_ree2_usb_otg_fs_core : R/W; bitpos: [3]; default: 0;
         *  Configures usb_otg_fs_core registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_usb_otg_fs_core:1;
        /** write_tee_usb_otg_fs_core : R/W; bitpos: [4]; default: 1;
         *  Configures usb_otg_fs_core registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_usb_otg_fs_core:1;
        /** write_ree0_usb_otg_fs_core : R/W; bitpos: [5]; default: 0;
         *  Configures usb_otg_fs_core registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_usb_otg_fs_core:1;
        /** write_ree1_usb_otg_fs_core : R/W; bitpos: [6]; default: 0;
         *  Configures usb_otg_fs_core registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_usb_otg_fs_core:1;
        /** write_ree2_usb_otg_fs_core : R/W; bitpos: [7]; default: 0;
         *  Configures usb_otg_fs_core registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_usb_otg_fs_core:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_usb_otg_fs_core_ctrl_reg_t;

