espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/tee_struct.h
/** Type of tee_ctrl register
 *  tee read/write control register
 */
typedef union {
    struct {
        /** read_tee_tee : R/W; bitpos: [0]; default: 1;
         *  Configures tee registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_tee:1;
        /** read_ree0_tee : HRO; bitpos: [1]; default: 0;
         *  Configures tee registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_tee:1;
        /** read_ree1_tee : HRO; bitpos: [2]; default: 0;
         *  Configures tee registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_tee:1;
        /** read_ree2_tee : HRO; bitpos: [3]; default: 0;
         *  Configures tee registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_tee:1;
        /** write_tee_tee : R/W; bitpos: [4]; default: 1;
         *  Configures tee registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_tee:1;
        /** write_ree0_tee : HRO; bitpos: [5]; default: 0;
         *  Configures tee registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_tee:1;
        /** write_ree1_tee : HRO; bitpos: [6]; default: 0;
         *  Configures tee registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_tee:1;
        /** write_ree2_tee : HRO; bitpos: [7]; default: 0;
         *  Configures tee registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_tee:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_tee_ctrl_reg_t;

/** Type of km_ctrl register
 *  crypt read/write control register
 */
typedef union {
    struct {
        /** read_tee_km : R/W; bitpos: [0]; default: 1;
         *  Configures km registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_km:1;
        /** read_ree0_km : R/W; bitpos: [1]; default: 0;
         *  Configures km registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_km:1;
        /** read_ree1_km : R/W; bitpos: [2]; default: 0;
         *  Configures km registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_km:1;
        /** read_ree2_km : R/W; bitpos: [3]; default: 0;
         *  Configures km registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_km:1;
        /** write_tee_km : R/W; bitpos: [4]; default: 1;
         *  Configures km registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_km:1;
        /** write_ree0_km : R/W; bitpos: [5]; default: 0;
         *  Configures km registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_km:1;
        /** write_ree1_km : R/W; bitpos: [6]; default: 0;
         *  Configures km registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_km:1;
        /** write_ree2_km : R/W; bitpos: [7]; default: 0;
         *  Configures km registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_km:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_km_ctrl_reg_t;

/** Type of crypt_ctrl register
 *  crypt read/write control register
 */
typedef union {
    struct {
        /** read_tee_crypt : R/W; bitpos: [0]; default: 1;
         *  Configures crypt registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_crypt:1;
        /** read_ree0_crypt : R/W; bitpos: [1]; default: 0;
         *  Configures crypt registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_crypt:1;
        /** read_ree1_crypt : R/W; bitpos: [2]; default: 0;
         *  Configures crypt registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_crypt:1;
        /** read_ree2_crypt : R/W; bitpos: [3]; default: 0;
         *  Configures crypt registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_crypt:1;
        /** write_tee_crypt : R/W; bitpos: [4]; default: 1;
         *  Configures crypt registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_crypt:1;
        /** write_ree0_crypt : R/W; bitpos: [5]; default: 0;
         *  Configures crypt registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_crypt:1;
        /** write_ree1_crypt : R/W; bitpos: [6]; default: 0;
         *  Configures crypt registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_crypt:1;
        /** write_ree2_crypt : R/W; bitpos: [7]; default: 0;
         *  Configures crypt registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_crypt:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_crypt_ctrl_reg_t;

/** Type of core0_trace_ctrl register
 *  core0_trace read/write control register
 */
typedef union {
    struct {
        /** read_tee_core0_trace : R/W; bitpos: [0]; default: 1;
         *  Configures core0_trace registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_core0_trace:1;
        /** read_ree0_core0_trace : R/W; bitpos: [1]; default: 0;
         *  Configures core0_trace registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_core0_trace:1;
        /** read_ree1_core0_trace : R/W; bitpos: [2]; default: 0;
         *  Configures core0_trace registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_core0_trace:1;
        /** read_ree2_core0_trace : R/W; bitpos: [3]; default: 0;
         *  Configures core0_trace registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_core0_trace:1;
        /** write_tee_core0_trace : R/W; bitpos: [4]; default: 1;
         *  Configures core0_trace registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_core0_trace:1;
        /** write_ree0_core0_trace : R/W; bitpos: [5]; default: 0;
         *  Configures core0_trace registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_core0_trace:1;
        /** write_ree1_core0_trace : R/W; bitpos: [6]; default: 0;
         *  Configures core0_trace registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_core0_trace:1;
        /** write_ree2_core0_trace : R/W; bitpos: [7]; default: 0;
         *  Configures core0_trace registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_core0_trace:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_core0_trace_ctrl_reg_t;

/** Type of core1_trace_ctrl register
 *  core1_trace read/write control register
 */
typedef union {
    struct {
        /** read_tee_core1_trace : R/W; bitpos: [0]; default: 1;
         *  Configures core1_trace registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_core1_trace:1;
        /** read_ree0_core1_trace : R/W; bitpos: [1]; default: 0;
         *  Configures core1_trace registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_core1_trace:1;
        /** read_ree1_core1_trace : R/W; bitpos: [2]; default: 0;
         *  Configures core1_trace registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_core1_trace:1;
        /** read_ree2_core1_trace : R/W; bitpos: [3]; default: 0;
         *  Configures core1_trace registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_core1_trace:1;
        /** write_tee_core1_trace : R/W; bitpos: [4]; default: 1;
         *  Configures core1_trace registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_core1_trace:1;
        /** write_ree0_core1_trace : R/W; bitpos: [5]; default: 0;
         *  Configures core1_trace registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_core1_trace:1;
        /** write_ree1_core1_trace : R/W; bitpos: [6]; default: 0;
         *  Configures core1_trace registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_core1_trace:1;
        /** write_ree2_core1_trace : R/W; bitpos: [7]; default: 0;
         *  Configures core1_trace registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_core1_trace:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_core1_trace_ctrl_reg_t;

