espressif/esp-idf/components/soc/esp32h4/register/hw_ver_beta5/soc/tee_struct.h
/** Type of modem_ctrl register
 *  modem read/write control register
 */
typedef union {
    struct {
        /** read_tee_modem : R/W; bitpos: [0]; default: 1;
         *  Configures modem registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_modem:1;
        /** read_ree0_modem : R/W; bitpos: [1]; default: 0;
         *  Configures modem registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_modem:1;
        /** read_ree1_modem : R/W; bitpos: [2]; default: 0;
         *  Configures modem registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_modem:1;
        /** read_ree2_modem : R/W; bitpos: [3]; default: 0;
         *  Configures modem registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_modem:1;
        /** write_tee_modem : R/W; bitpos: [4]; default: 1;
         *  Configures modem registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_modem:1;
        /** write_ree0_modem : R/W; bitpos: [5]; default: 0;
         *  Configures modem registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_modem:1;
        /** write_ree1_modem : R/W; bitpos: [6]; default: 0;
         *  Configures modem registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_modem:1;
        /** write_ree2_modem : R/W; bitpos: [7]; default: 0;
         *  Configures modem registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_modem:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_modem_ctrl_reg_t;

/** Type of zero_det_ctrl register
 *  zero_det read/write control register
 */
typedef union {
    struct {
        /** read_tee_zero_det : R/W; bitpos: [0]; default: 1;
         *  Configures zero_det registers read permission in tee mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_tee_zero_det:1;
        /** read_ree0_zero_det : R/W; bitpos: [1]; default: 0;
         *  Configures zero_det registers read permission in ree0 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree0_zero_det:1;
        /** read_ree1_zero_det : R/W; bitpos: [2]; default: 0;
         *  Configures zero_det registers read permission in ree1 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree1_zero_det:1;
        /** read_ree2_zero_det : R/W; bitpos: [3]; default: 0;
         *  Configures zero_det registers read permission in ree2 mode.
         *  0: can not be read
         *  1: can be read
         */
        uint32_t read_ree2_zero_det:1;
        /** write_tee_zero_det : R/W; bitpos: [4]; default: 1;
         *  Configures zero_det registers write permission in tee mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_tee_zero_det:1;
        /** write_ree0_zero_det : R/W; bitpos: [5]; default: 0;
         *  Configures zero_det registers write permission in ree0 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree0_zero_det:1;
        /** write_ree1_zero_det : R/W; bitpos: [6]; default: 0;
         *  Configures zero_det registers write permission in ree1 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree1_zero_det:1;
        /** write_ree2_zero_det : R/W; bitpos: [7]; default: 0;
         *  Configures zero_det registers write permission in ree2 mode.
         *  0: can not be write
         *  1: can be write
         */
        uint32_t write_ree2_zero_det:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} tee_zero_det_ctrl_reg_t;


/** Group: config register */
/** Type of bus_err_conf register
 *  Clock gating register
 */
typedef union {
    struct {
        /** bus_err_resp_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether return error response to cpu when access blocked
         *  0: disable error response
         *  1: enable error response
         */
        uint32_t bus_err_resp_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} tee_bus_err_conf_reg_t;


/** Group: clock gating register */
/** Type of clock_gate register
 *  Clock gating register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  Configures whether to keep the clock always on.
         *  0: enable automatic clock gating
         *  1: keep the clock always on
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} tee_clock_gate_reg_t;


/** Group: Version control register */
/** Type of date register
 *  Version control register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 37818480;
         *  Version control register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} tee_date_reg_t;


typedef struct {
    volatile tee_mn_mode_ctrl_reg_t mn_mode_ctrl[32];
    volatile tee_gpspi0_ctrl_reg_t gpspi0_ctrl;
    volatile tee_gpspi1_ctrl_reg_t gpspi1_ctrl;
    volatile tee_uart0_ctrl_reg_t uart0_ctrl;
    volatile tee_uart1_ctrl_reg_t uart1_ctrl;
    volatile tee_uhci_ctrl_reg_t uhci_ctrl;
    volatile tee_i2c0_ctrl_reg_t i2c0_ctrl;
    volatile tee_i2c1_ctrl_reg_t i2c1_ctrl;
    volatile tee_i2s_ctrl_reg_t i2s_ctrl;
    volatile tee_parl_io_ctrl_reg_t parl_io_ctrl;
    volatile tee_pwm0_ctrl_reg_t pwm0_ctrl;
    volatile tee_pwm1_ctrl_reg_t pwm1_ctrl;
    volatile tee_ledc_ctrl_reg_t ledc_ctrl;
    volatile tee_can_ctrl_reg_t can_ctrl;
    volatile tee_usb_serial_jtag_ctrl_reg_t usb_serial_jtag_ctrl;
    volatile tee_rmt_ctrl_reg_t rmt_ctrl;
    volatile tee_gdma_ctrl_reg_t gdma_ctrl;
    volatile tee_regdma_ctrl_reg_t regdma_ctrl;
    volatile tee_etm_ctrl_reg_t etm_ctrl;
    volatile tee_intmtx_core0_ctrl_reg_t intmtx_core0_ctrl;
    volatile tee_intmtx_core1_ctrl_reg_t intmtx_core1_ctrl;
    volatile tee_apb_adc_ctrl_reg_t apb_adc_ctrl;
    volatile tee_timergroup0_ctrl_reg_t timergroup0_ctrl;
    volatile tee_timergroup1_ctrl_reg_t timergroup1_ctrl;
    volatile tee_systimer_ctrl_reg_t systimer_ctrl;
    volatile tee_misc_ctrl_reg_t misc_ctrl;
    volatile tee_src_ctrl_reg_t src_ctrl;
    volatile tee_usb_otg_fs_core_ctrl_reg_t usb_otg_fs_core_ctrl;
    volatile tee_usb_otg_fs_phy_ctrl_reg_t usb_otg_fs_phy_ctrl;
    volatile tee_pvt_monitor_ctrl_reg_t pvt_monitor_ctrl;
    volatile tee_pcnt_ctrl_reg_t pcnt_ctrl;
    volatile tee_iomux_ctrl_reg_t iomux_ctrl;
    volatile tee_psram_mem_monitor_ctrl_reg_t psram_mem_monitor_ctrl;
    volatile tee_mem_acs_monitor_ctrl_reg_t mem_acs_monitor_ctrl;
    volatile tee_hp_system_reg_ctrl_reg_t hp_system_reg_ctrl;
    volatile tee_pcr_reg_ctrl_reg_t pcr_reg_ctrl;
    volatile tee_mspi_ctrl_reg_t mspi_ctrl;
    volatile tee_hp_apm_ctrl_reg_t hp_apm_ctrl;
    volatile tee_cpu_apm_ctrl_reg_t cpu_apm_ctrl;
    volatile tee_tee_ctrl_reg_t tee_ctrl;
    volatile tee_km_ctrl_reg_t km_ctrl;
    volatile tee_crypt_ctrl_reg_t crypt_ctrl;
    volatile tee_core0_trace_ctrl_reg_t core0_trace_ctrl;
    volatile tee_core1_trace_ctrl_reg_t core1_trace_ctrl;
    volatile tee_cpu_bus_monitor_ctrl_reg_t cpu_bus_monitor_ctrl;
    volatile tee_intpri_reg_ctrl_reg_t intpri_reg_ctrl;
    volatile tee_cache_cfg_ctrl_reg_t cache_cfg_ctrl;
    volatile tee_modem_ctrl_reg_t modem_ctrl;
    volatile tee_zero_det_ctrl_reg_t zero_det_ctrl;
    uint32_t reserved_140[940];
    volatile tee_bus_err_conf_reg_t bus_err_conf;
    uint32_t reserved_ff4;
    volatile tee_clock_gate_reg_t clock_gate;
    volatile tee_date_reg_t date;
} tee_dev_t;

extern tee_dev_t TEE;

#ifndef __cplusplus
_Static_assert(sizeof(tee_dev_t) == 0x1000, "Invalid size of tee_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
